[Killed] BlockStatement
user/admin.js:15:43
 const batch = require('../batch');
 
 module.exports = function (User) {
-    User.logIP = async function (uid, ip) {
-        if (!(parseInt(uid, 10) > 0)) {
-            return;
-        }
-        const now = Date.now();
-        const bulk = [
-            [`uid:${uid}:ip`, now, ip || 'Unknown'],
-        ];
-        if (ip) {
-            bulk.push([`ip:${ip}:uid`, now, uid]);
-        }
-        await db.sortedSetAddBulk(bulk);
-    };
+    User.logIP = async function (uid, ip) {};
 
     User.getIPs = async function (uid, stop) {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "b6635032-e78c-4b20-ba0e-7ec257c03882",

[Killed] ConditionalExpression
user/admin.js:16:13
 
 module.exports = function (User) {
     User.logIP = async function (uid, ip) {
-        if (!(parseInt(uid, 10) > 0)) {
+        if (false) {
             return;
         }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "b6635032-e78c-4b20-ba0e-7ec257c03882",

[Killed] EqualityOperator
user/admin.js:16:15
 
 module.exports = function (User) {
     User.logIP = async function (uid, ip) {
-        if (!(parseInt(uid, 10) > 0)) {
+        if (!(parseInt(uid, 10) <= 0)) {
             return;
         }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "b6635032-e78c-4b20-ba0e-7ec257c03882",

[Killed] ConditionalExpression
user/admin.js:21:36
         }
         const now = Date.now();
         const bulk = [
-            [`uid:${uid}:ip`, now, ip || 'Unknown'],
+            [`uid:${uid}:ip`, now, false],
         ];
         if (ip) {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "b6635032-e78c-4b20-ba0e-7ec257c03882",

[Killed] ConditionalExpression
user/admin.js:21:36
         }
         const now = Date.now();
         const bulk = [
-            [`uid:${uid}:ip`, now, ip || 'Unknown'],
+            [`uid:${uid}:ip`, now, true],
         ];
         if (ip) {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "b6635032-e78c-4b20-ba0e-7ec257c03882",

[Killed] BlockStatement
user/admin.js:23:17
         const bulk = [
             [`uid:${uid}:ip`, now, ip || 'Unknown'],
         ];
-        if (ip) {
-            bulk.push([`ip:${ip}:uid`, now, uid]);
-        }
+        if (ip) {}
         await db.sortedSetAddBulk(bulk);
     };
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
user/admin.js:23:13
         const bulk = [
             [`uid:${uid}:ip`, now, ip || 'Unknown'],
         ];
-        if (ip) {
+        if (false) {
             bulk.push([`ip:${ip}:uid`, now, uid]);
         }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "b6635032-e78c-4b20-ba0e-7ec257c03882",

[Killed] ArrayDeclaration
user/admin.js:24:23
             [`uid:${uid}:ip`, now, ip || 'Unknown'],
         ];
         if (ip) {
-            bulk.push([`ip:${ip}:uid`, now, uid]);
+            bulk.push([]);
         }
         await db.sortedSetAddBulk(bulk);
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
user/admin.js:29:46
         await db.sortedSetAddBulk(bulk);
     };
 
-    User.getIPs = async function (uid, stop) {
-        const ips = await db.getSortedSetRevRange(`uid:${uid}:ip`, 0, stop);
-        return ips.map(ip => validator.escape(String(ip)));
-    };
+    User.getIPs = async function (uid, stop) {};
 
     User.getUsersCSV = async function () {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ArrowFunction
user/admin.js:31:24
 
     User.getIPs = async function (uid, stop) {
         const ips = await db.getSortedSetRevRange(`uid:${uid}:ip`, 0, stop);
-        return ips.map(ip => validator.escape(String(ip)));
+        return ips.map(() => undefined);
     };
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
user/admin.js:34:42
         return ips.map(ip => validator.escape(String(ip)));
     };
 
-    User.getUsersCSV = async function () {
-        winston.verbose('[user/getUsersCSV] Compiling User CSV data');
-
-        const data = await plugins.hooks.fire('filter:user.csvFields', { fields: ['uid', 'email', 'username'] });
-        let csvContent = `${data.fields.join(',')}\n`;
-        await batch.processSortedSet('users:joindate', async (uids) => {
-            const usersData = await User.getUsersFields(uids, data.fields);
-            csvContent += usersData.reduce((memo, user) => {
-                memo += `${data.fields.map(field => user[field]).join(',')}\n`;
-                return memo;
-            }, '');
-        }, {});
-
-        return csvContent;
-    };
+    User.getUsersCSV = async function () {};
 
     User.exportUsersCSV = async function () {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
user/admin.js:35:25
     };
 
     User.getUsersCSV = async function () {
-        winston.verbose('[user/getUsersCSV] Compiling User CSV data');
+        winston.verbose("");
 
         const data = await plugins.hooks.fire('filter:user.csvFields', { fields: ['uid', 'email', 'username'] });
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
user/admin.js:37:99
     User.getUsersCSV = async function () {
         winston.verbose('[user/getUsersCSV] Compiling User CSV data');
 
-        const data = await plugins.hooks.fire('filter:user.csvFields', { fields: ['uid', 'email', 'username'] });
+        const data = await plugins.hooks.fire('filter:user.csvFields', { fields: ['uid', 'email', ""] });
         let csvContent = `${data.fields.join(',')}\n`;
         await batch.processSortedSet('users:joindate', async (uids) => {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
user/admin.js:37:47
     User.getUsersCSV = async function () {
         winston.verbose('[user/getUsersCSV] Compiling User CSV data');
 
-        const data = await plugins.hooks.fire('filter:user.csvFields', { fields: ['uid', 'email', 'username'] });
+        const data = await plugins.hooks.fire("", { fields: ['uid', 'email', 'username'] });
         let csvContent = `${data.fields.join(',')}\n`;
         await batch.processSortedSet('users:joindate', async (uids) => {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
user/admin.js:39:72
 
         const data = await plugins.hooks.fire('filter:user.csvFields', { fields: ['uid', 'email', 'username'] });
         let csvContent = `${data.fields.join(',')}\n`;
-        await batch.processSortedSet('users:joindate', async (uids) => {
-            const usersData = await User.getUsersFields(uids, data.fields);
-            csvContent += usersData.reduce((memo, user) => {
-                memo += `${data.fields.map(field => user[field]).join(',')}\n`;
-                return memo;
-            }, '');
-        }, {});
+        await batch.processSortedSet('users:joindate', async (uids) => {}, {});
 
         return csvContent;
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
user/admin.js:41:60
         let csvContent = `${data.fields.join(',')}\n`;
         await batch.processSortedSet('users:joindate', async (uids) => {
             const usersData = await User.getUsersFields(uids, data.fields);
-            csvContent += usersData.reduce((memo, user) => {
-                memo += `${data.fields.map(field => user[field]).join(',')}\n`;
-                return memo;
-            }, '');
+            csvContent += usersData.reduce((memo, user) => {}, '');
         }, {});
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "b6635032-e78c-4b20-ba0e-7ec257c03882",

[Killed] AssignmentOperator
user/admin.js:41:13
         let csvContent = `${data.fields.join(',')}\n`;
         await batch.processSortedSet('users:joindate', async (uids) => {
             const usersData = await User.getUsersFields(uids, data.fields);
-            csvContent += usersData.reduce((memo, user) => {
-                memo += `${data.fields.map(field => user[field]).join(',')}\n`;
-                return memo;
-            }, '');
+            csvContent -= usersData.reduce((memo, user) => {
+  memo += `${data.fields.map(field => user[field]).join(',')}\n`;
+  return memo;
+}, '');
         }, {});
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ArrowFunction
user/admin.js:42:44
         await batch.processSortedSet('users:joindate', async (uids) => {
             const usersData = await User.getUsersFields(uids, data.fields);
             csvContent += usersData.reduce((memo, user) => {
-                memo += `${data.fields.map(field => user[field]).join(',')}\n`;
+                memo += `${data.fields.map(() => undefined).join(',')}\n`;
                 return memo;
             }, '');
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
user/admin.js:42:71
         await batch.processSortedSet('users:joindate', async (uids) => {
             const usersData = await User.getUsersFields(uids, data.fields);
             csvContent += usersData.reduce((memo, user) => {
-                memo += `${data.fields.map(field => user[field]).join(',')}\n`;
+                memo += `${data.fields.map(field => user[field]).join("")}\n`;
                 return memo;
             }, '');
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
user/admin.js:44:16
             csvContent += usersData.reduce((memo, user) => {
                 memo += `${data.fields.map(field => user[field]).join(',')}\n`;
                 return memo;
-            }, '');
+            }, "Stryker was here!");
         }, {});
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BooleanLiteral
user/admin.js:55:22
 
         const { fields, showIps } = await plugins.hooks.fire('filter:user.csvFields', {
             fields: ['email', 'username', 'uid'],
-            showIps: true,
+            showIps: false,
         });
         const fd = await fs.promises.open(
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
user/admin.js:58:32
             showIps: true,
         });
         const fd = await fs.promises.open(
-            path.join(baseDir, 'build/export', 'users.csv'),
+            path.join(baseDir, "", 'users.csv'),
             'w'
         );
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
user/admin.js:59:13
         });
         const fd = await fs.promises.open(
             path.join(baseDir, 'build/export', 'users.csv'),
-            'w'
+            ""
         );
         fs.promises.appendFile(fd, `${fields.join(',')}${showIps ? ',ip' : ''}\n`);
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
user/admin.js:61:68
             path.join(baseDir, 'build/export', 'users.csv'),
             'w'
         );
-        fs.promises.appendFile(fd, `${fields.join(',')}${showIps ? ',ip' : ''}\n`);
+        fs.promises.appendFile(fd, `${fields.join(',')}${showIps ? "" : ''}\n`);
         await batch.processSortedSet('users:joindate', async (uids) => {
             const usersData = await User.getUsersFields(uids, fields.slice());
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
user/admin.js:62:72
             'w'
         );
         fs.promises.appendFile(fd, `${fields.join(',')}${showIps ? ',ip' : ''}\n`);
-        await batch.processSortedSet('users:joindate', async (uids) => {
-            const usersData = await User.getUsersFields(uids, fields.slice());
-            let userIPs = '';
-            let ips = [];
-
-            if (showIps) {
-                ips = await db.getSortedSetsMembers(uids.map(uid => `uid:${uid}:ip`));
-            }
-
-            let line = '';
-            usersData.forEach((user, index) => {
-                line += `${fields.map(field => user[field]).join(',')}`;
-                if (showIps) {
-                    userIPs = ips[index] ? ips[index].join(',') : '';
-                    line += `,"${userIPs}"\n`;
-                } else {
-                    line += '\n';
-                }
-            });
-
-            await fs.promises.appendFile(fd, line);
-        }, {
+        await batch.processSortedSet('users:joindate', async (uids) => {}, {
             batch: 5000,
             interval: 250,
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "b6635032-e78c-4b20-ba0e-7ec257c03882",

[Killed] StringLiteral
user/admin.js:62:38
             'w'
         );
         fs.promises.appendFile(fd, `${fields.join(',')}${showIps ? ',ip' : ''}\n`);
-        await batch.processSortedSet('users:joindate', async (uids) => {
+        await batch.processSortedSet("", async (uids) => {
             const usersData = await User.getUsersFields(uids, fields.slice());
             let userIPs = '';
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] MethodExpression
user/admin.js:63:63
         );
         fs.promises.appendFile(fd, `${fields.join(',')}${showIps ? ',ip' : ''}\n`);
         await batch.processSortedSet('users:joindate', async (uids) => {
-            const usersData = await User.getUsersFields(uids, fields.slice());
+            const usersData = await User.getUsersFields(uids, fields);
             let userIPs = '';
             let ips = [];
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
user/admin.js:67:26
             let userIPs = '';
             let ips = [];
 
-            if (showIps) {
-                ips = await db.getSortedSetsMembers(uids.map(uid => `uid:${uid}:ip`));
-            }
+            if (showIps) {}
 
             let line = '';
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
user/admin.js:67:17
             let userIPs = '';
             let ips = [];
 
-            if (showIps) {
+            if (false) {
                 ips = await db.getSortedSetsMembers(uids.map(uid => `uid:${uid}:ip`));
             }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ArrowFunction
user/admin.js:68:62
             let ips = [];
 
             if (showIps) {
-                ips = await db.getSortedSetsMembers(uids.map(uid => `uid:${uid}:ip`));
+                ips = await db.getSortedSetsMembers(uids.map(() => undefined));
             }
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
user/admin.js:68:69
             let ips = [];
 
             if (showIps) {
-                ips = await db.getSortedSetsMembers(uids.map(uid => `uid:${uid}:ip`));
+                ips = await db.getSortedSetsMembers(uids.map(uid => ``));
             }
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
user/admin.js:72:48
             }
 
             let line = '';
-            usersData.forEach((user, index) => {
-                line += `${fields.map(field => user[field]).join(',')}`;
-                if (showIps) {
-                    userIPs = ips[index] ? ips[index].join(',') : '';
-                    line += `,"${userIPs}"\n`;
-                } else {
-                    line += '\n';
-                }
-            });
+            usersData.forEach((user, index) => {});
 
             await fs.promises.appendFile(fd, line);
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ArrowFunction
user/admin.js:73:39
 
             let line = '';
             usersData.forEach((user, index) => {
-                line += `${fields.map(field => user[field]).join(',')}`;
+                line += `${fields.map(() => undefined).join(',')}`;
                 if (showIps) {
                     userIPs = ips[index] ? ips[index].join(',') : '';
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
user/admin.js:74:21
             let line = '';
             usersData.forEach((user, index) => {
                 line += `${fields.map(field => user[field]).join(',')}`;
-                if (showIps) {
+                if (false) {
                     userIPs = ips[index] ? ips[index].join(',') : '';
                     line += `,"${userIPs}"\n`;
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
user/admin.js:74:30
             let line = '';
             usersData.forEach((user, index) => {
                 line += `${fields.map(field => user[field]).join(',')}`;
-                if (showIps) {
-                    userIPs = ips[index] ? ips[index].join(',') : '';
-                    line += `,"${userIPs}"\n`;
-                } else {
+                if (showIps) {} else {
                     line += '\n';
                 }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
user/admin.js:75:67
             usersData.forEach((user, index) => {
                 line += `${fields.map(field => user[field]).join(',')}`;
                 if (showIps) {
-                    userIPs = ips[index] ? ips[index].join(',') : '';
+                    userIPs = ips[index] ? ips[index].join(',') : "Stryker was here!";
                     line += `,"${userIPs}"\n`;
                 } else {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
user/admin.js:76:29
                 line += `${fields.map(field => user[field]).join(',')}`;
                 if (showIps) {
                     userIPs = ips[index] ? ips[index].join(',') : '';
-                    line += `,"${userIPs}"\n`;
+                    line += ``;
                 } else {
                     line += '\n';
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
user/admin.js:77:24
                 if (showIps) {
                     userIPs = ips[index] ? ips[index].join(',') : '';
                     line += `,"${userIPs}"\n`;
-                } else {
-                    line += '\n';
-                }
+                } else {}
             });
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
user/admin.js:78:29
                     userIPs = ips[index] ? ips[index].join(',') : '';
                     line += `,"${userIPs}"\n`;
                 } else {
-                    line += '\n';
+                    line += "";
                 }
             });
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",
